uhnp/src/InformationRegisters/УведомленияПоЭлектроннойПочте/УведомленияПоЭлектроннойПочте.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УведомленияПоЭлектроннойПочте</name>
  <resources>
    <name>Письмо</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>CatalogRef.РазделыСверкиВГО</types>
      <types>CatalogRef.Пользователи</types>
      <types>DocumentRef.НастраиваемыйОтчет</types>
      <types>DocumentRef.УрегулированиеРасхожденияВГО</types>
      <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
      <types>CatalogRef.АналитическаяПодписка</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
      <types>CatalogRef.МониторыКлючевыхПоказателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/УведомленияПоЭлектроннойПочте/Forms/ПросмотрПисьма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Письмо = ПолучитьИзВременногоХранилища(Параметры.АдресПисьма);
	УдалитьИзВременногоХранилища(Параметры.АдресПисьма);
	
	АдресПисьма = ПоместитьВоВременноеХранилище(Письмо, УникальныйИдентификатор);
	
	ДатаСоздания		 = Параметры.ДатаСоздания;
	Источник			 = Параметры.Источник;
	ИдентификаторПисьма	 = Параметры.ИдентификаторПисьма;
	
	Если ТипЗнч(Письмо) = Тип("ИнтернетПочтовоеСообщение") И Письмо.Тексты.Количество() > 0 Тогда
		
		ЗаголовокПисьма = Письмо.Заголовок;
		Если ТипЗнч(Письмо.Отправитель) = Тип("ИнтернетПочтовыйАдрес") Тогда
			Отправитель = Письмо.Отправитель.Адрес;
		Иначе
			Отправитель = Письмо.Отправитель;
		КонецЕсли;
		ПолученныйТекстПисьма = Письмо.Тексты[0];
		ТекстПисьма = ПолученныйТекстПисьма.Текст;
		Элементы.ТекстПисьма.ТекущаяСтраница = ?(ПолученныйТекстПисьма.ТипТекста = ТипТекстаПочтовогоСообщения.HTML, Элементы.HTMLТекст, Элементы.ОбычныйТекст);
		Для Каждого Элемент Из Письмо.Вложения Цикл
			СписокВложений.Добавить(Элемент.Имя);
		КонецЦикла;
		
		Для каждого Получатель Из Письмо.Получатели Цикл
			СписокПолучателей.Добавить(Получатель.Адрес);
		КонецЦикла;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтправитьПисьмо_Сервер(ДатаСоздания, Источник, АдресПисьма, ИдентификаторВход = "")
	
	Перем УчетнаяЗапись;
	РезультатФункции = Истина;	
	Массив = Новый Массив;
	Массив.Добавить(Новый Структура("ДатаСоздания, Источник", ДатаСоздания, Источник));
	УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	Почта = УправлениеЭлектроннойПочтойУХ.УстановитьСоединениеССервером(УчетнаяЗапись);
	
	Если Почта <> Неопределено Тогда
		Попытка                     
			// Непосредственная отправка электронного письма.
			Письмо = ПолучитьИзВременногоХранилища(АдресПисьма);
			Письмо.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
			Почта.Послать(Письмо);              		
			// Запись даты отправки в регистр.
			МенеджерЗаписи = РегистрыСведений.УведомленияПоЭлектроннойПочте.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ДатаСоздания			 = ДатаСоздания;
			МенеджерЗаписи.Источник				 = Источник;
			МенеджерЗаписи.ИдентификаторПисьма	 = ИдентификаторВход;
			МенеджерЗаписи.ДатаОтправки			 = ТекущаяДатаСеанса();
			МенеджерЗаписи.Письмо 				 = Новый ХранилищеЗначения(Письмо);
			МенеджерЗаписи.Записать(Истина);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			СообщениеПользователю.Сообщить();
			РезультатФункции = Ложь;
		КонецПопытки;
	Иначе
		ТекстСообщения = НСтр("ru = 'Не удалось получить учётную запись электронной почты. Отправка письма отменена.'");
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
		РезультатФункции = Ложь;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции

&НаКлиенте
Процедура ОтправитьПисьмо(Команда)
	
	РезультатОтправки = ОтправитьПисьмо_Сервер(ДатаСоздания, Источник, АдресПисьма, ИдентификаторПисьма);
	Если РезультатОтправки Тогда
		КартинкаОповещения = БиблиотекаКартинок.ОбщаяКартинка54ФЗEmail_32;
		ТекстОповещения = НСтр("ru = 'Отправка'");
		ПояснениеОповещения = НСтр("ru = 'Письмо успешно отправлено'");
		ПоказатьОповещениеПользователя(ТекстОповещения, , ПояснениеОповещения, КартинкаОповещения);
	Иначе
		ТекстСообщения = НСтр("ru = 'Не удалось отправить письмо'");
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложениеНаДиск(Команда)
	ТекДанные = Элементы.СписокВложений.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяВложения = ТекДанные.Значение;
	
	УИНДанных = Новый УникальныйИдентификатор;
	мДанныеПисьма = ПолучитьДанныеПисьмаССервера(АдресПисьма, ИмяВложения, УИНДанных);
	
	// Спросим имя файла у пользователя
	ПолноеИмяФайла = "";
	РасширениеПодключено = Неопределено;

	Оповещение = Новый ОписаниеОповещения("Подключаемый_СохранитьВложениеНаДиск", ЭтотОбъект, Новый Структура("мДанныеПисьма", мДанныеПисьма));
	НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СохранитьВложениеНаДиск(Подключено, ДополнительныеПараметры) Экспорт
    
    мДанныеПисьма = ДополнительныеПараметры.мДанныеПисьма;
        
    РасширениеПодключено = Подключено;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
    Диалог.Каталог = РаботаСФайламиУХ.ПолучитьИмяКаталога();
    Диалог.ПолноеИмяФайла = Диалог.Каталог + "\" + мДанныеПисьма.ИмяФайла;
    Диалог.Заголовок = НСтр("ru = 'Укажиет имя файла для сохранения'");
    Диалог.Фильтр = НСтр("ru = 'Все файлы (*.*)|*.*'");
    Диалог.ПредварительныйПросмотр = Ложь;
    Диалог.ПроверятьСуществованиеФайла = Ложь;
    Диалог.МножественныйВыбор = Ложь;
	
	ДопПараметры = Новый Структура("Диалог, мДанныеПисьма", Диалог, мДанныеПисьма);
	Оповещение = Новый ОписаниеОповещения("Подключаемый_СохранитьВФайл", ЭтотОбъект, ДопПараметры);
    Диалог.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СохранитьВФайл(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
    
    Диалог = ДополнительныеПараметры.Диалог;
    мДанныеПисьма = ДополнительныеПараметры.мДанныеПисьма;
        
    Если Не (ВыбранныеФайлы <> Неопределено) Тогда
        Возврат;
    КонецЕсли;
    
    ДвоичныеДанные = ПолучитьИзВременногоХранилища(мДанныеПисьма.АдресДанных);
    УдалитьИзВременногоХранилища(мДанныеПисьма.АдресДанных);
    ДвоичныеДанные.Записать(Диалог.ПолноеИмяФайла)

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПисьмаССервера(АдресПисьма, ИмяВложения, УИНДанных)
	Перем мДанныеПисьма;
	
	мДанныеПисьма = Новый Структура("ИмяФайла,АдресДанных");
	
	Письмо = ПолучитьИзВременногоХранилища(АдресПисьма);
	Для Каждого Элемент Из Письмо.Вложения Цикл
		Если Элемент.Имя <> ИмяВложения Тогда
			Продолжить;
		КонецЕсли;
		
		мДанныеПисьма.ИмяФайла = Элемент.ИмяФайла;
		мДанныеПисьма.АдресДанных = ПоместитьВоВременноеХранилище(Элемент.Данные, УИНДанных);
		Прервать;
	КонецЦикла;
	
	Возврат мДанныеПисьма;
КонецФункции;
